<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"2296f24a171164310686424c4ca3a86051a9dccb480af53e359b6b60f7ca0dab","plan_job_ref":"Job Test plan target and replace #355 at https://github.com/dflook/terraform-github-actions/actions/runs/5889751451","plan_hash":"c1816d17e3d9ba5479967ed2d782969ddaf20e8be4f761948a2b54b10c65f29a","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "Wym6nEvdgi" -> (known after apply)
  ~ foreach = "6WNSg0pTEK" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #355](https://github.com/dflook/terraform-github-actions/actions/runs/5889751451)